var dicDivison = new Array();				//镇街字典

//东莞市镇街字典
dicDivison['莞城街道'] = ["东正社区", "市桥社区", "北隅社区", "西隅社区", "罗沙社区", "博厦社区", "兴塘社区", "创业社区"]
dicDivison['南城街道'] = ["鸿福社区", "宏远社区", "胜和社区", "元美社区", "亨美社区", "三元里社区", "篁村社区", "新基社区", "周溪社区", "袁屋边社区", "白马社区", "石鼓社区", "蛤地社区", "西平社区", "雅园社区", "水濂社区", "新城社区", "宏图社区"]
dicDivison['东城街道'] = ["岗贝社区", "花园新村社区", "东泰社区", "温塘社区", "桑园社区", "周屋社区", "余屋社区", "鳌峙塘社区", "峡口社区", "柏洲边社区", "上桥社区", "下桥社区", "樟村社区", "梨川社区", "堑头社区", "主山社区", "石井社区", "同沙社区", "光明社区", "牛山社区", "立新社区", "火炼树社区", "星城社区"]
dicDivison['万江街道'] = ["万江墟社区", "万江社区", "石美社区", "莫屋社区", "拔蛟窝社区", "黄粘洲社区", "蚬涌社区", "谷涌社区", "小享社区", "滘联社区", "上甲社区", "新村社区", "新谷涌社区", "共联社区", "水蛇涌社区", "大莲塘社区", "牌楼基社区", "严屋社区", "大汾社区", "流涌尾社区", "金泰社区", "曲海社区", "坝头社区", "胜利社区", "官桥滘社区", "简沙洲社区", "新和社区", "新城社区", "坝新社区"]

dicDivison['石龙镇'] = ["西湖村", "忠维村", "林屋村", "蒲溪村", "新维村", "王屋洲村", "黄家山村", "中山东社区", "中山西社区", "兴龙社区"]
dicDivison['虎门镇'] = ["虎门寨社区", "东方社区", "则徐社区", "大宁社区", "树田社区", "白沙社区", "沙角社区", "怀德社区", "博涌社区", "镇口社区", "村头社区", "新联社区", "九门寨社区", "居岐社区", "金洲社区", "南面社区", "北栅社区", "小捷滘社区", "北面社区", "陈村社区", "东风社区", "武山沙社区", "黄村社区", "南栅社区", "龙眼社区", "宴岗社区", "赤岗", "路东社区", "新湾社区", "民泰社区"]
dicDivison['中堂镇'] = ["潢涌村", "三涌村", "湛翠村", "凤冲村", "袁家涌村", "吴家涌村", "鹤田村", "中堂村", "一村", "东向村", "蕉利村", "槎滘村", "下芦村", "马沥村", "四乡村", "中心社区", "斗朗社区", "红锋社区", "东泊社区", "江南社区"]
dicDivison['望牛墩镇'] = ["李屋村", "望东村", "扶涌村", "赤滘村", "五涌村", "下漕村", "上合村", "聚龙江村", "望联村", "洲湾村", "洲涡村", "杜屋村", "寮厦村", "芙蓉沙村", "官桥涌村", "横沥村", "福安村", "石排村", "官洲村", "朱平沙村", "锦涡村", "望牛墩社区"]
dicDivison['麻涌镇'] = ["麻一村", "麻三村", "麻四村", "大步村", "东太村", "新基村", "川槎村", "鸥涌村", "华阳村", "南洲村", "大盛村", "漳澎村", "黎滘村", "麻涌社区", "麻二社区"]
dicDivison['石碣镇'] = ["石碣村", "唐洪村", "黄泗围村", "西南村", "单屋村", "梁家村村", "沙腰村", "刘屋村", "水南村", "四甲村", "鹤田厦村", "涌口村", "横滘村", "桔洲村", "城中社区"]
dicDivison['高埗镇'] = ["冼沙村", "卢溪村", "宝莲村", "塘厦村", "草墩村", "护安围村", "保安围村", "三联村", "横滘头村", "低涌村", "朱磡村", "新联村", "欧邓村", "芦村村", "高埗村", "凌屋村", "上江城村", "下江城村", "新创社区"]
dicDivison['洪梅镇'] = ["洪屋涡村", "新庄村", "梅沙村", "氹涌村", "黎洲角夏汇村", "尧均村", "乌沙村", "金鳌沙村", "洪梅社区"]
dicDivison['道滘镇'] = ["南城村", "南丫村", "闸口村", "大鱼沙村", "小河永庆村", "北永村", "昌平村", "厚德村", "九曲村", "大罗沙村", "大岭丫村", "蔡白村", "兴隆社区"]
dicDivison['厚街镇'] = ["竹溪社区", "厚街社区", "珊美社区", "宝屯社区", "三屯社区", "陈屋社区", "赤岭社区", "河田寮厦社区", "汀山社区", "环冈社区", "大迳社区", "新围社区", "桥头社区", "南五社区", "新塘涌口社区", "双岗社区", "溪头社区", "沙塘社区", "宝塘社区", "下汴社区", "白濠社区", "湖景社区"]
dicDivison['沙田镇'] = ["中围村", "和安村", "大流村", "泥洲村", "杨公洲村", "福禄沙村", "阇西村", "民田村", "先锋村", "西大坦村", "穗丰年村", "大泥村", "齐沙村", "稔洲村", "义沙村", "西太隆", "横流社区", "滨港社区"]
dicDivison['长安镇'] = ["长盛社区", "涌头社区", "霄边社区", "咸西社区", "锦厦社区", "新安社区", "乌沙社区", "新民社区", "沙头社区", "上沙社区", "厦岗社区", "厦边社区", "上角社区"]
dicDivison['寮步镇'] = ["西溪村", "凫山村", "石龙坑村", "石步村", "良边村", "富竹山村", "塘唇村", "向西村", "霞边村", "上屯下岭贝村", "竹园村", "上底村", "药勒村", "刘屋巷浮竹山村", "陈家埔村", "井巷村", "小坑村", "长坑村", "寮步社区", "塘边社区", "横坑社区", "岭厦社区", "新旧围社区", "缪边社区", "牛杨社区", "泉塘社区", "坑口社区", "良平社区"]
dicDivison['大岭山镇'] = ["太公岭村", "大塘朗村", "下高田村", "连平村", "鸡翅岭村", "马蹄岗村", "金桔村", "大沙村", "百花洞村", "大塘村", "水朗村", "杨屋村", "矮岭冚村", "颜屋村", "大片美村", "梅林村", "元岭村", "大岭村", "新塘村", "旧飞鹅村", "大环村", "大岭山社区", "农场社区"]
dicDivison['大朗镇'] = ["高英村", "洋乌村", "洋坑塘村", "松柏朗村", "黎贝岭村", "松木山村", "犀牛陂村", "水平村", "宝陂村", "石厦村", "杨涌村", "沙步村", "新马莲村", "佛子凹村", "蔡边村", "水口村", "大朗社区", "佛新社区", "巷头社区", "屏山社区", "竹山社区", "巷尾社区", "求富路社区", "长塘社区", "黄草朗社区", "大井头社区", "圣堂社区", "长富社区"]
dicDivison['黄江镇'] = ["新市社区", "田美社区", "三新社区", "梅塘社区", "宝山社区", "北岸社区", "长龙社区"]
dicDivison['樟木头镇'] = ["圩镇社区", "樟罗社区", "百果洞社区", "樟洋社区", "石新社区", "柏地社区", "官仓社区", "裕丰社区", "金河社区", "樟新社区"]
dicDivison['凤岗镇'] = ["雁田村", "官井头村", "油甘埔村", "凤德岭村", "塘沥村", "黄洞村", "竹塘村", "竹尾田村", "三联五联村", "天堂围村", "凤岗社区"]
dicDivison['塘厦镇'] = ["塘厦社区", "林村社区", "石潭埔社区", "四村社区", "振兴围社区", "大坪社区", "莆心湖平山社区", "诸佛岭社区", "桥陇社区", "龙背岭社区", "石鼓社区", "田心社区", "横塘社区", "蛟乙塘社区", "凤凰岗社区", "莲湖社区", "沙湖社区", "石马社区", "清湖头社区", "塘新社区"]
dicDivison['谢岗镇'] = ["黎村村", "窑山村", "南面村", "大龙村", "大厚村", "赵林村", "稔子园村", "五星村", "曹乐村", "谢岗村", "谢山村", "泰园社区"]
dicDivison['清溪镇'] = ["浮岗村", "上元村", "清厦村", "铁松村", "铁场村", "谢坑村", "青皇村", "大埔村", "长山头村", "三中村", "九乡村", "三星村", "渔樑围村", "厦坭村", "大利村", "土桥村", "重河村", "松岗村", "罗马村", "荔横村", "清溪社区"]
dicDivison['常平镇'] = ["岗梓村", "塘角村", "苏坑村", "袁山贝村", "金美村", "还珠沥村", "朗贝村", "桥沥村", "卢屋村", "九江水村", "朗洲村", "陈屋贝村", "司马村", "霞坑村", "漱旧村", "漱新村", "黄泥塘村", "元江元村", "横江厦村", "沙湖口村", "白石岗村", "松柏塘村", "上坑村", "木棆村", "下墟村", "板石村", "田尾村", "白花沥村", "桥梓村", "麦元村", "土塘村", "常平社区", "新民社区"]
dicDivison['桥头镇'] = ["田头角村", "李屋村", "朗厦村", "岗头村", "屋厦村", "禾坑村", "邓屋村", "邵岗头村", "东江村", "山和村", "石水口村", "莲城社区", "田新社区", "桥头社区", "大洲社区", "迳联社区", "岭头社区"]
dicDivison['横沥镇'] = ["石涌村", "隔坑村", "半仙山村", "田头村", "田坑村", "横沥村", "村头村", "长巷村", "田饶步村", "六甲村", "村尾村", "水边村", "新四村", "山厦村", "月塘村", "张坑村", "恒泉社区"]
dicDivison['东坑镇'] = ["东坑村", "坑美村", "角社村", "塔岗村", "黄麻岭初坑村", "凤大村", "黄屋村", "寮边头村", "长安塘新门楼村", "井美村", "彭屋村", "丁屋村", "草塘社区", "骏达社区"]
dicDivison['企石镇'] = ["铁岗村", "深巷村", "湖美村", "博夏村", "上洞村", "江边村", "旧围村", "清湖村", "东平村", "上截村", "下截村", "东山村", "莫屋村", "杨屋村", "新南村", "南坑村", "铁炉坑村", "企石村", "霞朗", "宝石社区"]
dicDivison['石排镇'] = ["石排村", "福隆村", "庙边王村", "下沙村", "沙角黄家坣村", "赤坎村", "向西村", "水贝村", "田寮村", "横山村", "埔心村", "谷吓村", "塘尾村", "李家坊村", "田边村", "中坑村", "燕窝", "太和社区"]
dicDivison['茶山镇'] = ["上元村", "茶山村", "下朗村", "横江村", "增埗村", "卢边村", "寒溪水村", "南社村", "塘角村", "博头村", "冲美村", "粟边村", "孙屋村", "超朗村", "京山村", "刘黄	茶山圩社区", "茶溪社区"]


// 检查初始img字典
function getDivison_town(townName = "东莞市") {
	if (townName != "东莞市") return [];
	return dicDivison;
};

